
//#1
'number' + 3 + 3;
console.log('number' + 3 + 3); //result number33
//в данному прикладі відбулась операція конкатенація строк, тому що перше значенн строка 'number' а наступні значення числа 3 і 3, які були перетворені в строку

//#2
null + 3; 
console.log(null + 3); //result 3
// в данному значення 3, оримується, тому що null перетворюється в 0, а 0 + 3 = 3

//#3
5 && "qwerty"; 
console.log(5 && "qwerty"); //result qwerty 
//в даному виразі отримаємо true, оскільки обидва значення true, але виведеться останнє значення, тобто "qwerty"

//#4
+'40' + +'2' + "hillel"; 
console.log(+'40' + +'2' + "hillel"); //result 42hillel
//в данному виразі відбувається операція конкатенація, оскільки 40 , 2 та hillel є строками

//#5
'10' - 5 === 6; 
console.log('10' - 5 === 6); //result false
//в данному виразі відбувається операція віднімання, оскільки 10 є строкою, а 5 та 6 числами. False оскільки 5 не дорівнює 6

//#6
true + false; 
console.log(true + false); //result 1
//в данному виразі відбувається операція додавання, оскільки true перетворюється в 1, а false в 0

//#7
'4px' - 3;
console.log('4px' - 3); //result NaN
//в данному виразі відбувається операція віднімання, але так як 4px є строкою, а 3 числом, то виведеться NaN

//#8
'4' - 3; 
console.log('4' - 3); //result 1
//в данному виразі відбувається операція віднімання, оскільки 4 є строкою, а 3 числом

//#9
'6' + 3 ** 0; 
console.log('6' + 3 ** 0); //result 61
//в данному виразі відбувається операція конкатенація, оскільки 6 є строкою, а 3 ** 0 числом. 3 возводиться в степінь 0, тому результат буде 61

//#10
12 / '6'; 
console.log(12/'6');//result 2
//в данному виразі відбувається операція ділення, оскільки 12 є числом, а 6 строкою. Число приводиться до числа

//#11
'10' + (5 === 6);  
console.log('10' + (5 === 6)); //result 10false
//в данному виразі відбувається операція конкатенація, оскільки 10 є строкою, а 5 не дорівнює 6, що є false

//#12
null == ''; 
console.log(null == ''); //result false
//в данному виразі відбувається операція порівняння, але так як null не дорівнює пустій строкі, то результат буде false

//#13
3 ** (9 / 3); 
console.log(3 ** (9 / 3)); //result 27
//в данному виразі відбувається операція піднесення до степеня, 9 / 3 = 3, 3 ** 3 = 27 

//#14
!!'false' == !!'true'; 
console.log(!!'false' == !!'true'); //result true
//в данному виразі відбувається операція порівняння, але так як обидва значення true, тому що оператор !! - подвійне заперечення, то результат буде true

//#15
0 || '0' && 1; 
console.log(0 || '0' && 1); //result 1
// в данному виразі відбувається операція логічного І, але так як 0 є false, а '0' та 1 true, то результат буде 1

//#16
(+null == false) < 1; 
console.log((+null == false) < 1); //result true
// в данному виразі відбувається операція порівняння, але так як обидва значення true, тому що null перетворюється в 0, а false в 0, то результат буде true

//#17
false && true || true; 
console.log(false && true || true); //result true
//в данному виразі відбувається операція логічного І, але так як false є false, а true true, то результат буде true. Також оператор || повертає перше значення, яке є true, або останнє значення, якщо всі операнди — false.

//#18
false && (false || true);
console.log(false && (false || true)); //result false
//в данному виразі відбувається операція логічного І, але так як false є false, а false || true true, то результат буде false. 

//#19
(+null == false) < 1 ** 5; 
console.log((+null == false) < 1 ** 5); //result true
//в данному виразі відбувається операція порівняння, але так як обидва значення true, тому що null перетворюється в 0, а false в 0, то результат буде true